{
  "fullNameAlt": "Emil Echavarría - Desarrollador de Software",
  "jobTitle": "Desarrollador de Software",
  "description": "👨‍💻 Soy Desarrollador Full Stack Junior con experiencia en proyectos académicos, personales y freelance, creando soluciones completas desde UX/UI y frontend hasta backend y bases de datos. Destaco por mi proactividad y aprendizaje continuo. 🚀",
  "githubAlt": "Visita el perfil de GitHub de Emil",
  "linkedinAlt": "Visita el perfil de LinkedIn de Emil",
  "instagramAlt": "Visita el perfil de Instagram de Emil",
  "cvAlt": "Descarga el currículum de Emil",
  "about": {
    "title": "Sobre Mí",
    "subtitle": "Desarrollador apasionado creando experiencias digitales",
    "fullName": "Emil Echavarría",
    "jobTitle": "Desarrollador de Software",
    "description1": "💻 Soy <span class='text-blue-500 font-medium'>Emil Echavarría</span>, tengo 19 años y soy un <span class='text-blue-500 font-medium'>desarrollador de software junior</span>. Aunque mi enfoque abarca varias áreas de la programación, mi verdadera pasión está en el desarrollo front-end, donde disfruto creando experiencias interactivas y visualmente atractivas.",
    "description2": "<span class='text-blue-500 font-medium'>Me encanta explorar nuevas tecnologías</span> y aprender constantemente, lo que me permite mejorar mis habilidades y abordar los proyectos con una perspectiva más integral sobre el proceso de desarrollo de software.",
    "description3": "Siempre estoy buscando <span class='text-blue-500 font-medium'>nuevos desafíos</span> que me permitan crecer profesionalmente, colaborar en proyectos que tengan un impacto positivo en la tecnología y mantenerme a la vanguardia de las tendencias que están dando forma al futuro del desarrollo. 🚀",
    "profileImageAlt": "Emil Echavarría",
    "stats": {
      "years": "Años",
      "technologies": "Tecnologías",
      "projects": "Proyectos"
    },
    "experience": {
      "title": "Mi Experiencia",
      "jobTitle": "Desarrollador Web Freelance",
      "company": "Wix Studio - Contrato Mensual",
      "location": "Distrito Nacional, República Dominicana",
      "date": "2025-Presente",
      "dateLabel": "Actualidad",
      "responsibility1": "<span class='font-medium text-blue-200 block mb-1'>• Gestión integral del sitio web del cliente</span> Asegurando funcionalidad, seguridad y una experiencia de usuario profesional.",
      "responsibility2": "<span class='font-medium text-blue-200 block mb-1'>• Diseño e implementación de nuevas secciones y contenidos</span> Alineados con los objetivos estratégicos del cliente.",
      "responsibility3": "<span class='font-medium text-blue-200 block mb-1'>• Optimización continua de rendimiento y velocidad</span> Garantizando estabilidad y presentación visual atractiva.",
      "responsibility4": "<span class='font-medium text-blue-200 block mb-1'>• Trabajo autónomo y responsable</span> Cumpliendo entregas mensuales con organización y altos estándares de calidad.",
      "skills": ["Wix Studio", "Desarrollo Web", "Diseño UX/UI", "Optimización de Rendimiento", "Gestión de Contenidos"],
      "future": "Próximas experiencias...",
      "futureLabel": "Futuro"
    },
    "techStack": {
      "title": "Mi Stack Tecnológico",
      "subtitle": "Tecnologías con las que trabajo",
      "frontend": "Frontend",
      "backend": "Backend",
      "tools": "Herramientas de Desarrollo"
    }
  },
  "projects": {
    "title": "Proyectos",
    "subtitle": "Explora mi colección de proyectos que demuestran mis habilidades en desarrollo web y de software",
    "seeMore": "Ver Más",
    "demo": "Demo",
    "status": {
      "completed": "Completado",
      "inProgress": "En Proceso",
      "paused": "Pausado"
    },
    "modal": {
      "overview": "Resumen",
      "demo": "Demo",
      "technical": "Técnico",
      "demoTitle": "Demo del Proyecto",
      "images": "Imágenes",
      "description": "Descripción Detallada",
      "features": "Características Principales",
      "challenges": "Desafíos Técnicos",
      "techStack": "Stack Tecnológico",
      "architecture": "Arquitectura del Proyecto",
      "liveDemo": "Ver Demo en Vivo",
      "sourceCode": "Ver Código Fuente",
      "previous": "Anterior",
      "next": "Siguiente"
    },
    "gallery": {
      "screenshotAlt": "{{title}} captura {{index}}",
      "of": "de"
    },
    "dashbite": {
      "title": "DashBite",
      "date": "Ago 2025",
      "status": "Completado",
      "description": "DashBite es una plataforma fullstack diseñada para optimizar pedidos en línea y la gestión de operaciones para clientes, negocios, repartidores y administradores. Integra módulos completos que incluyen inicio de sesión y registro, gestión de perfiles, catálogos de productos, pedidos, direcciones, favoritos y paneles administrativos con reportes detallados. La plataforma está diseñada para mejorar la eficiencia del flujo de trabajo, ofreciendo una experiencia de usuario fluida y accesible, con un enfoque en la optimización de procesos operativos.",
      "shortDescription": "Plataforma fullstack para pedidos en línea y gestión, integrando módulos para clientes, negocios, repartidores y administradores.",
      "technologies": ["Express.js", "Handlebars", "JavaScript", "Tailwind CSS", "MySQL", "Railway"],
      "features": [
        "Gestión integral de pedidos en línea",
        "Paneles administrativos con reportes en tiempo real",
        "Sistema de autenticación y gestión de perfiles",
        "Catálogos interactivos y favoritos personalizados",
        "Interfaz optimizada para múltiples tipos de usuarios"
      ],
      "challenges": "Implementación de un sistema escalable para manejar múltiples tipos de usuarios y sincronización en tiempo real de pedidos.",
      "githubUrl": "Privado (solicitar acceso)",
      "category": "Aplicación Web",
      "architecture": {
        "layers": {
          "frontend-handlebars-tailwindcss": {
            "description": "Interfaz dinámica renderizada con Handlebars y estilizada con Tailwind CSS para un diseño responsive y moderno."
          },
          "backend-express-js": {
            "description": "API RESTful con Express.js para la gestión de pedidos, usuarios y reportes, con rutas optimizadas y autenticación segura."
          },
          "database-mysql": {
            "description": "Base de datos relacional con esquemas optimizados para consultas rápidas y manejo de grandes volúmenes de datos."
          },
          "deployment-railway": {
            "description": "Infraestructura de despliegue continuo con Railway, optimización automática y escalabilidad para alto tráfico."
          }
        }
      }
    },
    "agrogestor": {
      "title": "AgroGestor",
      "date": "Jun 2025",
      "status": "En Proceso",
      "description": "AgroGestor es una plataforma digital completa diseñada para revolucionar la gestión agrícola moderna. Esta aplicación web permite a los agricultores y empresas del sector agroindustrial optimizar sus procesos productivos mediante el control en tiempo real de cultivos, recursos y datos críticos. La plataforma integrará tecnologías IoT para el monitoreo continuo de condiciones ambientales, niveles de humedad del suelo, temperatura y otros parámetros vitales. Con un dashboard intuitivo y herramientas de análisis predictivo, AgroGestor facilita la toma de decisiones informadas, mejora la eficiencia de los recursos y maximiza los rendimientos de los cultivos. Además, permite exportar los cultivos en un archivo CSV según los filtros aplicados dentro de la aplicación. Ofrece planes de membresía escalables y notificaciones en tiempo real, con un enfoque en seguridad, accesibilidad y una experiencia de usuario intuitiva.",
      "shortDescription": "Aplicación fullstack para la gestión agrícola con un panel central que automatiza tareas, ventas y reportes.",
      "technologies": ["Express.js", "Next.js", "Tailwind CSS", "MySQL", "Railway", "React", "Node.js", "MongoDB", "Socket.io"],
      "features": [
        "Dashboard interactivo en tiempo real",
        "Gestión integral de cultivos",
        "Monitoreo de recursos agrícolas con IoT",
        "Reportes y análisis de datos automatizados",
        "Sistema de alertas automáticas y notificaciones en tiempo real"
      ],
      "challenges": "Integración de sensores IoT para monitoreo agrícola en tiempo real y optimización de la gestión de recursos.",
      "githubUrl": "https://github.com/tu-usuario/agrogestor",
      "category": "Aplicación Web",
      "architecture": {
        "layers": {
          "frontend-react-next-js": {
            "description": "Dashboard interactivo construido con React y Next.js, gráficos en tiempo real usando Chart.js y componentes reutilizables para visualización de datos agrícolas."
          },
          "backend-api-rest": {
            "description": "API RESTful con Node.js y Express para manejar datos de sensores IoT, procesamiento de alertas y generación de reportes automáticos."
          },
          "database-mongodb-mysql": {
            "description": "MongoDB para datos de sensores en tiempo real con índices temporales y MySQL para datos relacionales optimizados."
          },
          "iot-integration": {
            "description": "Sistema de comunicación con sensores agrícolas usando Socket.io para datos en tiempo real y protocolos MQTT para dispositivos IoT."
          },
          "deployment-railway": {
            "description": "Despliegue continuo con Railway, optimización automática y escalabilidad para alto tráfico."
          }
        }
      }
    },
    "stockify": {
      "title": "Stockify",
      "date": "May 2025",
      "status": "Completado",
      "description": "Stockify es una aplicación de escritorio desarrollada en C# con Windows Forms para la gestión de inventario y ventas, diseñada pensando en pequeñas y medianas empresas. Utilizando MySQL como base de datos, permite administrar clientes, productos y ventas de manera organizada y eficiente. La aplicación ofrece una interfaz intuitiva que facilita la navegación y el manejo de la información, ayudando a optimizar los procesos internos y a mantener un control claro sobre las operaciones diarias. Stockify está estructurada con programación en capas, lo que asegura un diseño limpio y modular, facilitando el mantenimiento y la escalabilidad.",
      "shortDescription": "Aplicación de escritorio en C# y Windows Forms para gestión de inventario y ventas, con base de datos MySQL y programación en capas.",
      "technologies": ["C#", ".NET Framework", "Windows Forms", "MySQL", "Entity Framework"],
      "features": [
        "Administración de clientes, productos y ventas",
        "Interfaz intuitiva y fácil de usar",
        "Programación en capas para un diseño modular",
        "Validaciones de datos y manejo de errores",
        "Gestión de información de manera organizada"
      ],
      "challenges": "Mantener un diseño modular en capas y optimizar la interacción entre la interfaz, la lógica de negocio y la base de datos.",
      "githubUrl": "https://github.com/EmilEchavarria/Stockify",
      "category": "Aplicación de Escritorio",
      "architecture": {
        "layers": {
          "presentation-windowsforms": {
            "description": "Interfaz de usuario nativa con Windows Forms, controles personalizados y manejo de eventos para una experiencia desktop fluida."
          },
          "businesslogic-csharp-classes": {
            "description": "Capa de lógica empresarial con clases C# para manejo de inventario, ventas y validaciones de negocio."
          },
          "dataaccess-entityframework": {
            "description": "Mapeo objeto-relacional con Entity Framework para manejo eficiente de datos y transacciones."
          },
          "database-mysql": {
            "description": "Base de datos relacional con MySQL, optimizada para consultas frecuentes y almacenamiento de información empresarial."
          }
        }
      }
    },
    "personal-portfolio": {
      "title": "Portafolio Personal",
      "date": "Sep 2025",
      "status": "Completado",
      "description": "Mi portafolio personal es una aplicación web que refleja mi experiencia y habilidades como desarrollador. Diseñado con un enfoque moderno y responsivo, permite explorar mis proyectos, experiencia académica, certificaciones y contacto de manera clara e interactiva. Cada sección está cuidadosamente organizada para brindar una experiencia de usuario intuitiva, mostrando mis competencias en frontend, diseño UI/UX y desarrollo web integral.",
      "shortDescription": "Portafolio web personal para mostrar proyectos, experiencia y habilidades de desarrollo. Diseño moderno y responsivo, centrado en la experiencia del usuario.",
      "technologies": ["React", "Next.js", "Tailwind CSS", "JavaScript", "Framer Motion"],
      "features": [
        "Exploración interactiva de proyectos y experiencia",
        "Secciones de educación, certificaciones y contacto",
        "Diseño responsive y moderno",
        "Animaciones y transiciones suaves",
        "Optimizado para experiencia de usuario y rendimiento"
      ],
      "challenges": "Diseñar una arquitectura modular y escalable que permita agregar nuevos proyectos y secciones fácilmente, manteniendo un diseño limpio y coherente.",
      "githubUrl": "https://github.com/EmilEchavarria/Portafolio",
      "category": "Aplicación Web",
      "architecture": {
        "layers": {
          "frontend-react-next-js": {
            "description": "Interfaz moderna con componentes reutilizables, navegación fluida y manejo de estados optimizado para rendimiento."
          },
          "ui-ux-design-animations": {
            "description": "Diseño centrado en la experiencia de usuario, con animaciones suaves y secciones visualmente atractivas."
          }
        }
      }
    },
    "electronic-organizer": {
      "title": "Electronic Organizer",
      "date": "Mar 2025",
      "status": "Completado",
      "description": "Electronic Organizer es una aplicación de escritorio desarrollada en C# .NET Framework con Windows Forms. Su arquitectura de cuatro capas permite un manejo organizado y modular de la información, mientras que MySQL asegura almacenamiento seguro y eficiente de los datos.",
      "shortDescription": "Aplicación de escritorio en C# para organizar información personal, con CRUD completo y arquitectura de 4 capas usando MySQL.",
      "technologies": ["C#", ".NET Framework", "Windows Forms", "MySQL", "MySQL Connector/NET", "4-Layer Architecture"],
      "features": [
        "CRUD completo: Insertar, modificar, buscar y eliminar registros",
        "Interfaz intuitiva con Windows Forms",
        "Base de datos MySQL segura y eficiente",
        "Arquitectura en 4 capas: Presentation, Business, Data, Entity",
        "Optimización de conexiones a MySQL"
      ],
      "challenges": "Implementar una arquitectura modular en C# manteniendo eficiencia en la comunicación con la base de datos.",
      "githubUrl": "https://github.com/EmilEchavarria/Electronic-Organizer",
      "category": "Aplicación de Escritorio",
      "architecture": {
        "layers": {
          "presentation-windowsforms": {
            "description": "Interfaz de usuario nativa con controles de Windows Forms y manejo de eventos."
          },
          "businesslayer-csharp-classes": {
            "description": "Capa de lógica de negocio que gestiona las operaciones CRUD y reglas de negocio."
          },
          "datalayer-mysql": {
            "description": "Capa de acceso a datos mediante MySQL Connector/NET, ejecutando consultas optimizadas."
          },
          "entitylayer": {
            "description": "Definición de entidades que representan la información de la agenda y facilitan la manipulación de datos."
          }
        }
      }
    },
    "auto-gleam": {
      "title": "Auto Gleam",
      "date": "Sep 2024",
      "status": "Completado",
      "description": "Auto Gleam es una aplicación web tipo SPA (Single Page Application) desarrollada en Angular, diseñada para facilitar la gestión de servicios de lavado de autos. La plataforma se enfoca en la experiencia del usuario, ofreciendo interfaces intuitivas y responsive. Los clientes pueden explorar los servicios disponibles, programar citas y consultar información relevante. La aplicación es completamente frontend, con un diseño modular que permite una administración visual organizada de la información.",
      "shortDescription": "Aplicación web SPA en Angular enfocada en la experiencia de usuario para gestión de servicios de lavado de autos. Aplicación completamente frontend.",
      "technologies": ["Angular", "TypeScript", "Material Design", "RxJS"],
      "features": [
        "Interfaz intuitiva y responsive",
        "Exploración de servicios de lavado",
        "Programación visual de citas",
        "Diseño modular y componentes reutilizables",
        "Optimizado para experiencia de usuario"
      ],
      "challenges": "Diseñar una aplicación SPA completamente frontend, manteniendo consistencia visual y una experiencia de usuario fluida.",
      "githubUrl": "https://github.com/EmilEchavarria/AutoGleam",
      "category": "Aplicación SPA",
      "architecture": {
        "layers": {
          "frontend-angular-spa": {
            "description": "Aplicación de una sola página con componentes modulares, routing avanzado y manejo reactivo de estados usando RxJS. Toda la lógica y simulación de datos se maneja en frontend."
          },
          "authentication-roles-simulation": {
            "description": "Gestión de usuarios y roles mediante lógica frontend, simulando funcionalidades administrativas y de cliente."
          }
        }
      }
    },
    "j-tag-events": {
      "title": "J Tag Events",
      "date": "Dic 2024",
      "status": "Completado",
      "description": "J Tag Events es un sitio web corporativo elegante y funcional desarrollado específicamente para una empresa líder en organización de eventos. Este proyecto representa una solución web completa construida con tecnologías fundamentales como HTML5, CSS3 y JavaScript vanilla, demostrando que es posible crear experiencias digitales impactantes sin depender de frameworks complejos. El sitio web presenta un catálogo interactivo y visualmente atractivo de todos los servicios ofrecidos por la empresa, desde eventos corporativos hasta celebraciones privadas. Cada sección del sitio ha sido cuidadosamente diseñada para destacar la profesionalidad y creatividad de la empresa, incluyendo una galería dinámica que muestra eventos realizados con efectos de transición suaves y un sistema de filtrado por categorías. La plataforma también incorpora un formulario de contacto completamente funcional con validación en tiempo real, sistema de cotizaciones automáticas e integración con redes sociales. El diseño responsive garantiza una experiencia óptima en todos los dispositivos, mientras que las animaciones y efectos visuales cuidadosamente implementados crean una navegación fluida y atractiva.",
      "shortDescription": "Sitio web desarrollado con HTML, CSS y JavaScript para una empresa de eventos. Incluye catálogo de servicios, secciones informativas y diseño responsive.",
      "technologies": ["HTML5", "CSS3", "JavaScript", "Bootstrap", "AOS"],
      "features": [
        "Catálogo interactivo de servicios",
        "Galería de eventos realizados",
        "Formulario de contacto funcional",
        "Diseño responsive optimizado",
        "Animaciones y efectos visuales"
      ],
      "challenges": "Crear una experiencia visual impactante usando solo tecnologías vanilla con animaciones fluidas.",
      "githubUrl": "https://github.com/EmilEchavarria/J_Tag_Events",
      "category": "Sitio Web",
      "architecture": {
        "layers": {
          "frontend-html5-css3": {
            "description": "Estructura semántica con HTML5 y estilos avanzados usando CSS3, incluyendo flexbox, grid y animaciones CSS puras."
          },
          "interactivity-javascript-vanilla": {
            "description": "Funcionalidades dinámicas implementadas con JavaScript puro, incluyendo validación de formularios y efectos de scroll."
          },
          "ui-framework-bootstrap": {
            "description": "Sistema de componentes responsive con Bootstrap para garantizar compatibilidad cross-browser y diseño móvil-first."
          }
        }
      }
    }
  },
  "education": {
    "title": "Educación",
    "subtitle": "Formación Académica y Desarrollo Profesional",
    "items": {
      "softwareDevelopmentTechnologist": {
        "graduation": "Graduación: 2026",
        "status": "En Proceso",
        "title": "Tecnólogo en Desarrollo de Software",
        "provider": "ITLA (Instituto Tecnológico de las Américas)",
        "description": "Formación integral en todas las etapas del desarrollo de software, con un fuerte enfoque práctico en tareas técnicas. Competente en la aplicación de conocimientos, técnicas, habilidades y herramientas modernas de la disciplina para actividades de ingeniería tecnológica."
      },
      "metaFrontendDeveloper": {
        "completion": "Finalización: 2026",
        "status": "En Proceso",
        "title": "Certificado Profesional de Desarrollador Front-End de Meta",
        "provider": "Meta (Facebook)",
        "description": "Formación integral en desarrollo front-end, cubriendo HTML, CSS, JavaScript, React.js y diseño responsivo. Desarrollo de habilidades prácticas a través de proyectos prácticos, culminando en un proyecto final que demuestra competencia en la construcción de aplicaciones web dinámicas y responsivas."
      },
      "englishCourse": {
        "date": "2022 - 2024",
        "status": "Completado",
        "title": "Curso Extracurricular de Inglés",
        "provider": "UASD (Universidad Autónoma de Santo Domingo)",
        "description": "Un curso extracurricular de inglés diseñado para mejorar las habilidades en el idioma inglés, incluyendo comprensión auditiva, lectura, escritura y expresión oral. Estructurado en niveles progresivos durante 2 años, proporcionando un dominio avanzado del idioma para contextos profesionales y académicos."
      }
    },
    "certifications": {
      "title": "Certificaciones Profesionales",
      "subtitle": "Certificaciones reconocidas por la industria que validan mi experiencia técnica",
      "completed": "Completado en {{year}}",
      "items": {
        "introductionFrontend": {
          "title": "Introducción al Desarrollo Front-End"
        },
        "cssInDepth": {
          "title": "HTML y CSS en Profundidad"
        },
        "programmingJavaScript": {
          "title": "Programación con JavaScript"
        },
        "versionControlGit": {
          "title": "Control de Versiones con Git"
        },
        "frontendAngular": {
          "title": "Desarrollo Front-End con Angular"
        },
        "backendCsharp": {
          "title": "Desarrollo Backend con C# .Net"
        },
        "frontendReact": {
          "title": "Desarrollo Front-End con React"
        },
        "uxuiDesign": {
          "title": "Diseño UX/UI"
        }
      }
    },
    "certificateGallery": {
      "title": "Galería de Certificados",
      "subtitle": "Exposición visual de mis logros",
      "items": {
        "introductionFrontend": {
          "title": "Introducción al Desarrollo Front-End",
          "alt": "Certificado de Introducción al Desarrollo Front-End"
        },
        "cssInDepth": {
          "title": "HTML y CSS en Profundidad",
          "alt": "Certificado de HTML y CSS en Profundidad"
        },
        "programmingJavaScript": {
          "title": "Programación con JavaScript",
          "alt": "Certificado de Programación con JavaScript"
        },
        "versionControlGit": {
          "title": "Control de Versiones",
          "alt": "Certificado de Control de Versiones"
        },
        "frontendAngular": {
          "title": "Desarrollo Front-End con Angular",
          "alt": "Certificado de Desarrollo Front-End con Angular"
        },
        "frontendReact": {
          "title": "Desarrollo Front-End con React",
          "alt": "Certificado de Desarrollo Front-End con React"
        },
        "backendCsharp": {
          "title": "Desarrollo Backend con C# .Net",
          "alt": "Certificado de Desarrollo Backend con C# .Net"
        }
      }
    },
    "cta": "Explora Mis Proyectos"
  },
  "contact": {
      "title": "Contáctame",
      "subtitle": "No dudes en contactarme usando el formulario a continuación",
      "form": {
        "firstName": "Nombre",
        "firstNamePlaceholder": "Tu Nombre",
        "lastName": "Apellido",
        "lastNamePlaceholder": "Tu Apellido",
        "email": "Tu Email",
        "emailPlaceholder": "Tu Dirección de Email",
        "phone": "Teléfono",
        "phonePlaceholder": "Tu Número de Teléfono",
        "message": "Tu Mensaje",
        "messagePlaceholder": "Escribe tu mensaje aquí...",
        "submitButton": "Enviar Mensaje"
      },
      "alerts": {
        "success": {
          "title": "Mensaje Enviado",
          "text": "Gracias por contactarme. Te responderé pronto."
        },
        "error": {
          "title": "Error",
          "text": "Algo salió mal. Por favor intenta de nuevo."
        },
        "confirmButton": "Aceptar"
    }
  }
}